meshing/blockMesh_mesh/ellipse_removed/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
	// Verticies for outer mesh
	(-6.0 -5.1250 0.000) // Vertex 0
	(-1.0 -5.1250 0.000) // Vertex 1
	(-1.0  0.0000 0.000) // Vertex 2
	(-6.0  0.0000 0.000) // Vertex 3
	( 0.0 -5.1250 0.000) // Vertex 4
	( 0.0  0.0000 0.000) // Vertex 5
	( 1.0 -5.1250 0.000) // Vertex 6
	( 1.0  0.0000 0.000) // Vertex 7
	(11.0 -5.1250 0.000) // Vertex 8
	(11.0  0.0000 0.000) // Vertex 9
	(11.0  5.1250 0.000) // Vertex 10
	( 1.0  5.1250 0.000) // Vertex 11
	( 0.0  5.1250 0.000) // Vertex 12
	(-1.0  5.1250 0.000) // Vertex 13
	(-6.0  5.1250 0.000) // Vertex 14
	(-6.0 -5.1250 0.500) // Vertex 15
	(-1.0 -5.1250 0.500) // Vertex 16
	(-1.0  0.0000 0.500) // Vertex 17
	(-6.0  0.0000 0.500) // Vertex 18
	( 0.0 -5.1250 0.500) // Vertex 19
	( 0.0  0.0000 0.500) // Vertex 20
	( 1.0 -5.1250 0.500) // Vertex 21
	( 1.0  0.0000 0.500) // Vertex 22
	(11.0 -5.1250 0.500) // Vertex 23
	(11.0  0.0000 0.500) // Vertex 24
	(11.0  5.1250 0.500) // Vertex 25
	( 1.0  5.1250 0.500) // Vertex 26
	( 0.0  5.1250 0.500) // Vertex 27
	(-1.0  5.1250 0.500) // Vertex 38
	(-6.0  5.1250 0.500) // Vertex 29


	
); 

blocks
(
	// Blocks for outer mesh
	hex (15 16 1 0 18 17 2 3) (60 1 40) simpleGrading (1 1 1) // Block 0
	hex (16 19 4 1 17 20 5 2) (60 1 40) simpleGrading (1 1 1) // Block
	hex (19 21 6 4 20 22 7 5) (60 1 40) simpleGrading (1 1 1) // Block
	hex (21 23 8 6 22 24 9 7) (60 1 40) simpleGrading (1 1 1) // Block
	hex (18 17 2 3 29 28 13 14) (60 1 40) simpleGrading (1 1 1) // Block
	hex (17 20 5 2 28 27 12 13) (60 1 40) simpleGrading (1 1 1) // Block
	hex (20 22 7 5 27 26 11 12) (60 1 40) simpleGrading (1 1 1) // Block
	hex (22 24 9 7 26 25 10 11) (60 1 40) simpleGrading (1 1 1) // Block
);

edges
(
);

boundary
(

	inlet
	{
		type wall;
		faces
		(
			(0 15 18 3)
			(3 18 29 14)
		);
	}
	
	outlet
	{
		type wall;
		faces
		(
			(23 8 9 24)
			(24 9 10 25)
		);
	}
	
	
	topAndBottom
	{
		type wall;
		faces
		(
			//Faces in top			
			(28 13 14 29)
			(27 12 13 28)
			(26 11 12 27)
			(25 10 11 26)
			
			//Faces in bottom			
			(15 0 1 16)
			(16 1 4 19)
			(19 4 6 21)
			(21 6 8 23)
		);
	}	
	
	frontAndBack
	{
		type empty;
		faces
		(
			//Faces in back			
			(8 6 7 9)
			(6 4 5 7)
			(4 1 2 5)
			(1 0 3 2)
			(9 7 11 10)
			(7 5 12 11)
			(5 2 13 12)
			(2 3 14 13)
			
			//Faces in front
			(15 16 17 18)
			(16 19 20 17)
			(19 21 22 20)
			(21 23 24 22)
			(18 17 28 29)
			(17 20 27 28)
			(20 22 26 27)
			(22 24 25 26)
		);
	}

  
);

mergePatchPairs
(
);

// ************************************************************************* //
