meshing/blockMesh_mesh/ellipse_removed/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            wall;
        nFaces          80;
        startFace       38080;
    }
    outlet
    {
        type            wall;
        nFaces          80;
        startFace       38160;
    }
    topAndBottom
    {
        type            wall;
        nFaces          480;
        startFace       38240;
    }
    frontAndBack
    {
        type            empty;
        nFaces          38400;
        startFace       38720;
    }
)

// ************************************************************************* //
